#[cfg(test)]
use crate::tests::Mapping;

crate::create_transcriber!(
    lang_name: "Тайский",
    lang_rules: {
        // Royal Thai General System of Transcription (RTGS)
        // adapted for Russian Cyrillic
        // ===================================================================
        //  LETTERS
        // ===================================================================
        "A" => "А", "B" => "Б", "C" => "К", "D" => "Д",
        "E" => "Е", "F" => "Ф", "G" => "Г", "H" => "Х",
        "I" => "И", "J" => "Ч", "K" => "К", "L" => "Л",
        "M" => "М", "N" => "Н", "O" => "О", "P" => "П",
        "R" => "Р", "S" => "С", "T" => "Т", "U" => "У",
        "V" => "В", "W" => "В", "X" => "КС", "Y" => "Й",
        "Z" => "З",

        // ===================================================================
        //  CONSONANTS & ASPIRANTS
        // ===================================================================
        "K" => "К", "KH" => "КХ",
        "P" => "П", "PH" => "ПХ", "BH" => "ПХ",
        "T" => "Т", "TH" => "ТХ",
        "CH" => "Ч", "SH" => "Ч",
        "NG" => "НГ",
        "JJ" => "ТЧ",

        // P + Vowels & Diphthongs (deviations from RTGS)
        "PA" => "ПХА", "PE" => "ПХЕ", "PI" => "ПХИ",
        "PO" => "ПХО", "PU" => "ПХУ",

        "PAI" => "ПХАЙ", "PAE" => "ПХЭ",
        "PEE" => "ПХИ", "PEO" => "ПХЭО", "PER" => "ПХЭ",
        "PIA" => "ПХИА", "PIE" => "ПХИА",
        "POE" => "ПХЕ", "POI" => "ПХОЙ",
        "PUE" => "ПХЫ",

        // T + Vowels & Diphthongs (deviations from RTGS)
        "TA" => "ТХА", "TE" => "ТХЕ", "TI" => "ТХИ",
        "TO" => "ТХО", "TU" => "ТХУ",

        "TAI" => "ТХАЙ", "TAE" => "ТХЭ",
        "TEE" => "ТХИ", "TEO" => "ТХЭО", "TER" => "ТХЭ",
        "TIA" => "ТХИА", "TIE" => "ТХИА",
        "TOE" => "ТХЕ", "TOI" => "ТХОЙ",
        "TUE" => "ТХЫ",

        // ===================================================================
        //  VOWELS & DIPHTHONGS
        // ===================================================================
        "AI" => "АЙ", "AE" => "Э",
        "EE" => "И", "EO" => "ЭО", "ER" => "Э",
        "IA" => "ИА", "IE" => "ИА",
        "OE" => "Е", "OI" => "ОЙ",
        "UE" => "Ы",

        // YA/YU
        "YA" => "ЬЯ",
        "YU" => "Ю",

        // YA diphtong variations
        "AYA" => "АЯ",  "EYA" => "ЕЯ", "IYA" => "ИЯ",
        "OYA" => "ОЯ", "UYA" => "УЯ",

        // ===================================================================
        //  POSITION DEPENDENT
        // ===================================================================
        // Initial consonant clusters
        "|SR" => "С",

        // Final consonants
        "CH|" => "Т", "TH|" => "Т", "S|" => "Т",
        "KH|" => "К",
        "J|" => "Т",
        "L|" => "Н", "N|" => "Н", "R|" => "Н",
        "RN|" => "Н",
        "F|" => "П", "PH|" => "П",
        "TRA|" => "Т",
        "UCK|" => "АК",

        // ===================================================================
        //  DICTIONARY
        // ===================================================================
        "THAKSIN" => "ТАКСИН",
    },
    mappings: {
        vec![
            // ===================================================================
            //  HEADS OF GOVERNMENT (PRIME MINISTERS - recent)
            // ===================================================================
            Mapping { from: "Chuan Leekpai", to: "Чуан Ликпхай" },
            Mapping { from: "Thaksin Shinawatra", to: "Таксин Чинават" },
            Mapping { from: "Surayud Chulanont", to: "Сураюд Чуланонт" },
            Mapping { from: "Samak Sundaravej", to: "Самак Сундаравет" },
            Mapping { from: "Somchai Wongsawat", to: "Сомчай Вонгсават" },
            Mapping { from: "Abhisit Vejjajiva", to: "Апхисит Ветчачива" },
            Mapping { from: "Yingluck Shinawatra", to: "Йинглак Чинават" },
            // Mapping { from: "Prayut Chan-o-cha", to: "Прают Чан-Оча" },
            Mapping { from: "Srettha Thavisin", to: "Сеттха Тхависин" },
            Mapping { from: "Paetongtarn Shinawatra", to: "Пхэтхонгтхан Чинават" },
        ]
    }
);
